src/src/DataProcessors/FillCostLayerRegisters.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>FillCostLayerRegisters</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/src/InformationRegisters/TasksForCostsCalculation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>TasksForCostsCalculation</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Month</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TaskNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/AccumulationRegisters/InventoryCostLayer.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>InventoryCostLayer</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>SourceRecord</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SourceDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InventoryWriteOff</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AccountSalesFromConsignee</v8:Type>
						<v8:Type>cfg:DocumentRef.InventoryTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReportIssued</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.GoodsReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.ShiftClosure</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrSalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrStructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RIMTransfer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesRep</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CostLayer</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CostLayer</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/AccumulationRegisters/LandedCosts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>LandedCosts</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>SourceRecord</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SourceDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InventoryWriteOff</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AccountSalesFromConsignee</v8:Type>
						<v8:Type>cfg:DocumentRef.InventoryTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReportIssued</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.GoodsReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.ShiftClosure</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrSalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrStructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RIMTransfer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesRep</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CostLayer</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CostLayer</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/AccumulationRegisters/Sales.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Sales</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Cost</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ObsoleteAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>OfflineRecord</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.RegistersCorrection</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AccountSalesFromConsignee</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesSlip</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReportIssued</v8:Type>
						<v8:Type>cfg:DocumentRef.ExpenseReport</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.ShiftClosure</v8:Type>
						<v8:Type>cfg:DocumentRef.AccountSalesToConsignor</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesRep</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/DataProcessors/FillCostLayerRegisters/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Procedure Posting(Parameters, StorageAddress = "") Export
	
	SetPrivilegedMode(True);
	
	WriteLogEvent(
		NStr("en = 'FIFO.Posting documents'", CommonUseClientServer.MainLanguageCode()),
		EventLogLevel.Information,
		,
		NStr("en = 'Start posting documents'"),
		EventLogEntryTransactionMode.Transactional);
		
	SourceRegisters = New Array;
	SourceRegisters.Add(Metadata.AccumulationRegisters.Inventory);
	SourceRegisters.Add(Metadata.AccumulationRegisters.LandedCosts);
	
	DocumentsForPosting = New Array();
	// Inventory
	DocumentsForPosting.Add(Metadata.Documents.ExpenseReport);
	DocumentsForPosting.Add(Metadata.Documents.InventoryIncrease);
	DocumentsForPosting.Add(Metadata.Documents.OpeningBalanceEntry);
	DocumentsForPosting.Add(Metadata.Documents.SupplierInvoice);
	// Landed costs
	DocumentsForPosting.Add(Metadata.Documents.AdditionalExpenses);
	DocumentsForPosting.Add(Metadata.Documents.CustomsDeclaration);
	
	DocumentsPeriod = DocumentsPeriod(SourceRegisters);
	
	If DocumentsPeriod.BeginPeriod = Undefined Then
		Parameters.Insert("LoadingIsCompleted", False);
		Parameters.Insert("MessageText", NStr("en = 'There are no documents for posting'"));
	Else
		CurrentMonth = DocumentsPeriod.BeginPeriod;
		If ValueIsFilled(DocumentsPeriod.EndPeriod) Then
			While CurrentMonth < DocumentsPeriod.EndPeriod Do
				
				EndOfCurrentMonth = EndOfMonth(CurrentMonth);
				
				PostDocuments(DocumentsForPosting, CurrentMonth, EndOfCurrentMonth);
				
				CurrentMonth = AddMonth(CurrentMonth, 1);
				
			EndDo;
		EndIf;
		Parameters.Insert("LoadingIsCompleted", True);
	EndIf;
	
	If ValueIsFilled(StorageAddress) Then
		PutToTempStorage(Parameters, StorageAddress);
	EndIf;
EndProcedure
	
#EndRegion

#Region Private

Function DocumentsPeriod(SourceRegisters)
	
	QueryTextTemplate = "
	|SELECT
	|	MIN(Table.Period) AS BeginPeriod,
	|	MAX(Table.Period) AS EndPeriod
	|FROM
	|	&RegisterName AS Table";
	
	Query = New Query;
	DocumentsPeriod = New Structure("BeginPeriod, EndPeriod", Undefined, Undefined);
	
	For Each SourceRegister In SourceRegisters Do
		
		Query.Text = StrReplace(QueryTextTemplate, "&RegisterName", "AccumulationRegister." + SourceRegister.Name);
		Selection = Query.Execute().Select();
		Selection.Next();
		
		If DocumentsPeriod.BeginPeriod = Undefined Then
			FillPropertyValues(DocumentsPeriod, Selection);
		Else
			If ValueIsFilled(Selection.BeginPeriod)
				And Selection.BeginPeriod < DocumentsPeriod.BeginPeriod Then
				DocumentsPeriod.BeginPeriod = BegOfMonth(Selection.BeginPeriod);
			EndIf;
			If ValueIsFilled(Selection.EndPeriod)
				And Selection.EndPeriod > DocumentsPeriod.EndPeriod Then
				DocumentsPeriod.EndPeriod = EndOfMonth(Selection.EndPeriod) + 1;
			EndIf;
		EndIf;
	EndDo;
	
	Return DocumentsPeriod;
EndFunction

Procedure PostDocuments(Documents, BeginOfMonth, EndOfMonth)
	
	QueryTextTemplate = "
	|SELECT
	|	Doc.Ref AS Ref,
	|	Doc.Date AS Data,
	|	Doc.Company AS Company
	|FROM
	|	&DocumentName AS Doc
	|WHERE
	|	Doc.Date BETWEEN &BegOfPeriod AND &EndOfPeriod
	|	AND Doc.Posted";
	
	Query = New Query;
	Query.SetParameter("BegOfPeriod", BeginOfMonth);
	Query.SetParameter("EndOfPeriod", EndOfMonth);
	
	Companies = New Array;
	CostLayerRegisters = CostLayerRegisters();
	
	For Each Document In Documents Do
		
		Query.Text = StrReplace(QueryTextTemplate, "&DocumentName", "Document." + Document.Name);
		Selection = Query.Execute().Select();
		
		While Selection.Next() Do
			Companies.Add(Selection.Company);
			WriteRecordsToRegister(Selection.Ref, CostLayerRegisters);
		EndDo;
		
	EndDo;
	
	Query.Text = 
	"SELECT
	|	Task.Month AS Month,
	|	Task.TaskNumber AS TaskNumber,
	|	Task.Company AS Company,
	|	Task.Document AS Document
	|INTO TempTasks
	|FROM
	|	InformationRegister.TasksForCostsCalculation AS Task
	|
	|UNION ALL
	|
	|SELECT
	|	&CurrentMonth,
	|	1,
	|	Companies.Ref,
	|	UNDEFINED
	|FROM
	|	Catalog.Companies AS Companies
	|WHERE
	|	Companies.Ref IN(&ArrayOfCompanies)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Task.Month AS Month,
	|	MIN(Task.TaskNumber) AS TaskNumber,
	|	Task.Company AS Company,
	|	Task.Document AS Document
	|FROM
	|	TempTasks AS Task
	|
	|GROUP BY
	|	Task.Month,
	|	Task.Company,
	|	Task.Document";
	
	Query.SetParameter("ArrayOfCompanies", Companies);
	Query.SetParameter("CurrentMonth", BeginOfMonth);
	Result = Query.Execute();
	
	Records = InformationRegisters.TasksForCostsCalculation.CreateRecordSet();
	Records.Load(Result.Unload());
	Records.Write();
	
EndProcedure

Function CostLayerRegisters()
	
	CostLayerRegisters = New Structure;
	CostLayerRegisters.Insert("TableInventoryCostLayer", AccumulationRegisters.InventoryCostLayer);
	CostLayerRegisters.Insert("TableLandedCosts", AccumulationRegisters.LandedCosts);
	CostLayerRegisters.Insert("TableInventory", AccumulationRegisters.Inventory);
	CostLayerRegisters.Insert("TableSales", AccumulationRegisters.Sales);
	CostLayerRegisters.Insert("TableAccountingJournalEntries", AccountingRegisters.AccountingJournalEntries);
	
	Return CostLayerRegisters;
EndFunction

Procedure WriteRecordsToRegister(Ref, RegistersForPosting)
	
	Var Table;
	
	BeginTransaction();
	
	AdditionalProperties = New Structure("IsNew, WriteMode", True, DocumentWriteMode.Posting);
	DriveServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	Documents[AdditionalProperties.ForPosting.DocumentMetadata.Name].InitializeDocumentData(Ref, AdditionalProperties);
	Tables = AdditionalProperties.TableForRegisterRecords;
	
	For Each Register In RegistersForPosting Do
		If Tables.Property(Register.Key, Table) Then
			WriteRecords(Register.Value, Table, Ref);
		EndIf;
	EndDo;
	
	CommitTransaction();
	
EndProcedure

Procedure WriteRecords(RegisterManager, Table, Ref)
	
	Records = RegisterManager.CreateRecordSet();
	Records.Filter.Recorder.Set(Ref);
	Records.Read();
	
	If Records.Count() > 0 Or Table.Count() > 0 Then
		Records.Load(Table);
		Records.Write(True);
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
